verification/flat-plate/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0     0     0)
    (0.02  0     0)
    (0.22  0     0)
    (0     0.05  0)
    (0.02  0.05  0)
    (0.22  0.05  0)
    (0     0     0.01)
    (0.02  0     0.01)
    (0.22  0     0.01)
    (0     0.05  0.01)
    (0.02  0.05  0.01)
    (0.22  0.05  0.01)
);

blocks
(
    hex (0 1 4 3 6 7 10 9) (30 60 1) simpleGrading (0.5 33 1)
    hex (1 2 5 4 7 8 11 10) (200 60 1) simpleGrading (5 33 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 9 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 8 11 5)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 9 10 4)
            (4 10 11 5)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 6 7 1)
        );
    }
    plate
    {
        type wall;
        faces
        (
            (1 7 8 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
            (6 9 10 7)
            (7 10 11 8)
        );
    }
);

mergePatchPairs
(
);

