verification/flat-plate/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    top
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    plate
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    frontAndBack
    {
        type            empty;
    }
}
