verification/flat-plate/system/sampleDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

sets
(
    plateLine
    {
        type        face;
        axis        x;
        start       (0.02 0.0 0.005);
        end         (0.22 0.0 0.005);
    }
);

fields ( wallHeatFlux );

